#ifndef _INTEGRALS_ANALYTIC_H_
#define _INTEGRALS_ANALYTIC_H_

#include <array>

//==============================================================================================
//--------------------------------Integral 1/|x-y|----------------------------------------------
//==============================================================================================
//Четырехугольная ячейка
//Брать эту функцию, или численную - решать вне.
double integral1Divr(const double (&rut0)[4][3], const double* x);



//==============================================================================================
//--------------------------------Integral d/dn(1/|x-y|)----------------------------------------
//==============================================================================================
//Четырехугольная ячейка, точка не лежит на ячейке
void integral_ddn_1Divr(const double (&rut0)[4][3], const double* x, double& res);



//==============================================================================================
//--------------------------------Integral (x-y)/(|x-y|^2)--------------------------------------
//==============================================================================================
//Ниже предполагается четырехугольная ячейка, точка лежит на ячейке
void integral_xmyDivr2(const double (&rut0)[4][3], const double* x, double* res);



//==============================================================================================
//--------------------------------Integral nu/|x-y|(curvilinear)--------------------------------
//==============================================================================================
//Четырехугольная ячейка
void integralnu1Divr(const double (&rut0)[4][3], const double* x, const double eps, double* res);





//==============================================================================================
//--------------Полуаналитический поверхностный интеграл по ячейке от функции-------------------
//-----------------------F(x-y) = e^ik|x - y| / 4 * pi * |x - y|--------------------------------
//==============================================================================================
#include "f_par.h"
#include "integral_par.h"
#include "integral_universal_pnt.h"
#include "kernel_lib.h"

void integral_simple_pot_G(const double* x, const double (&rut0)[4][3], 
        const f_par& param, const integral_par& int_param, 
        std::complex<double>& ff);

#endif