#ifndef _CELL_H_
#define _CELL_H_

//===============================================================================================
//--------------------------Класс четырехугольной ячейки-----------------------------------------
//===============================================================================================
class Cell
{
public:
    double cell[4][3];     // координаты ячейки
    double tau[2][3];      // два базисных вектора ячейки
    double rkt[3];         // точка коллокации
    double norm[3];        // вектор нормали к ячейке
    double s;              // площадь ячейки

    Cell();                // Конструктор по умолчанию
    Cell(const Cell& obj); // конструктор копирования

    void Cell_fill(const double (&cell_in)[4][3]);// функция заполнения одной ячейки
};
#endif